xml/soap.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<OpenJobEx xmlns="http://roblox.com/">
			<job>
				<id>_TASK_ID</id>
				<expirationInSeconds>30</expirationInSeconds>
				<category>1</category>
				<cores>1</cores>
			</job>
			<script>
				<name>RenderScript</name>
				<script>
					_RENDER_SCRIPT
				</script>
			</script>
			<arguments>
				<LuaValue>
					<type>LUA_TSTRING</type>
					<value>_BASE_URL</value>
				</LuaValue>
				<LuaValue>
					<type>LUA_TSTRING</type>
					<value>_THUMBNAIL_KEY</value>
				</LuaValue>
				<LuaValue>
					<type>LUA_TSTRING</type>
					<value>_RENDER_TYPE</value>
				</LuaValue>
				<LuaValue>
					<type>LUA_TNUMBER</type>
					<value>_ASSET_ID</value>
				</LuaValue>
			</arguments>
		</OpenJobEx>
	</soap:Body>
</soap:Envelope>